{
    "DataScience": "Required Technical and Professional Expertise\nBachelor's degree in Computer Science, Statistics, Mathematics, or a related field.\nStrong programming skills in Python and proficiency in relevant libraries (NumPy, Pandas, Scikit-learn).\nUnderstanding of machine learning concepts and algorithms (linear regression, logistic regression, decision trees, random forests, etc.).\nAbility to work with large datasets and perform data analysis.\nStrong problem-solving and analytical skills.\nExcellent communication and teamwork abilities.\nA passion for learning and exploring new technologies.\nPreferred Technical And Professional Expertise\nExperience with deep learning frameworks (TensorFlow, PyTorch).\nKnowledge of cloud platforms (AWS, Azure).\nExposure to big data technologies (Hadoop, Spark).\nParticipation in machine learning competitions or projects.\n",
    "Devops": "Requirements\nWhat we need from you\nBachelor's degree in Computer Science, Information Technology, or related field\nProven experience as a Software Engineer or DevOps Engineer\nStrong knowledge of Linux system administration\nHands-on experience creating and managing bare-metal Kubernetes clusters\nFamiliarity with Docker containerization\nBasic understanding of Helm charts\nProficiency in scripting (e.g., Bash, Python) and infrastructure as code tools (e.g., Terraform, Ansible)\nExperience with CI/CD pipelines and related tools (e.g., Jenkins, GitLab CI)\nKnowledge of cloud platforms, particularly AWS, is a plus\nStrong problem-solving skills and a commitment to automation and efficiency\nExcellent communication and collaboration skills\n",
    "Frontend": "\nExperience with Design Thinking Methodology.\nExperience with Agile development methodology.\nExcellent troubleshooting skills including multi-browser compatibility issues.\nExcellent communication.\n3+ years of experience in front-end development. \nBachelor's degree in computer science, Information Technology, or a related field. \nProficient in JavaScript, HTML5, CSS3, and modern frontend frameworks such as React or Angular. \nExperience with version control systems, particularly Git\nStrong communication skills and the ability to work collaboratively. \nProblem-solving skills and attention to detail. \n",
    "JavaDeveloper": "BS/MS degree in Computer Science, Engineering or a related subject\n1 to 3 years working experience in software development experience in Java SE, Java EE \n1 to 2  years working experience in Oracle Database SQL and PL/SQL\nHands on experience in designing and developing applications using Java EE platforms\nObject Oriented analysis and design using common design patterns.\nProfound insight of Java and JEE internals (Classloading, Memory Management, Transaction management etc)\nExcellent knowledge of Relational Databases, SQL and ORM technologies (JPA2, Hibernate)\nExperience in the Spring Framework\nSun Certified Java Developer\nExperience in developing web applications using at least one popular web framework (JSF, Wicket, GWT, Spring MVC)\nExperience with test-driven development\nExperience in reports generation (Jasper Reports)\nKnowledge of concurrency patterns & multi-threading in Java\nSolid understanding of object-oriented programming\nImplementing automated testing platforms and unit tests\nProficient understanding of code versioning tools, such as Git\nFamiliarity with build tools such as Ant, Maven\nSpring , Rest API’s\nWillingness to learn new technologies",
    "Testing": "\nRequirements:\nBachelor’s degree in Computer Science, Engineering, or a related field (or equivalent experience).\nProven experience as a QA Tester specifically focused on mobile applications and front-end automation.\nSolid understanding of QA methodologies, tools, and processes.\nExperience with automated testing tools/frameworks (e.g., Selenium, Appium, XCTest, Espresso).\nExperience in using tools like datadog will be advantage\nStrong analytical and troubleshooting skills with the ability to communicate effectively with technical and non-technical stakeholders.\nDetail-oriented with a passion for quality and continuous improvement.\nPreferred Qualifications:\nExperience working in an Agile/Scrum development environment.\nFamiliarity with continuous integration/delivery pipelines.\nKnowledge of mobile app security testing practices.\nISTQB or other relevant certifications.\n",
    "UIUX": "Proven experience as a Graphic Designer and UI/UX Designer (portfolio required).\nProficiency in design tools like Adobe Creative Suite (Photoshop, Illustrator, InDesign) and UI/UX tools like Figma, Sketch, or Adobe XD.\nStrong understanding of visual elements (layout, typography, color theory) as well as UX principles (user flow, interaction design).\nExperience in creating wireframes, mockups, and prototypes.\nKnowledge of front-end technologies (HTML, CSS, JavaScript) is a plus but not required.\nAbility to balance aesthetics with usability and accessibility.\nStrong communication skills and the ability to work collaboratively with cross-functional teams."
}